app/controllers/posts_controller.rb

UPDATE "posts" SET "updated_at" = ?, "views" = ? WHERE "posts"."id" = ?  [["updated_at", "2022-08-04 11:28:14.750755"], ["views", 1], ["id", 1]]
---
  def show
    @post.update(views: @post.views + 1)

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "pppppppp"], ["body", "ppsdfkjsnjf kjd hcs dkajdn as"], ["created_at", "2022-08-02 11:23:28.807992"], ["updated_at", "2022-08-02 11:23:28.807992"]]
---
  def create
    @post = Post.new(post_params)
    @post.user = current_user

    respond_to do |format|
      if @post.save